import {Button} from 'antd'
export default function Policy() {
    const policyText = `นโยบายการเก็บข้อมูลผู้ใช้\n\nเว็บไซต์ของเรามีการเก็บข้อมูลบางประการเพื่อปรับปรุงประสบการณ์การใช้งานของผู้ใช้ และเพื่อการวิเคราะห์ข้อมูล โดยเฉพาะอย่างยิ่ง เราเก็บข้อมูลที่อยู่ IP ของผู้ใช้ ซึ่งช่วยให้เราสามารถ:\n\n1. ปรับปรุงบริการ: การเก็บข้อมูล IP ช่วยให้เราสามารถวิเคราะห์การเข้าถึงเว็บไซต์และปรับปรุงประสิทธิภาพของบริการให้ดียิ่งขึ้น\n2. รักษาความปลอดภัย: ข้อมูล IP จะช่วยให้เราสามารถตรวจสอบและป้องกันการเข้าถึงที่ไม่พึงประสงค์หรือการกระทำที่เป็นอันตราย\n3. วิเคราะห์ข้อมูล: เราอาจใช้ข้อมูล IP เพื่อวิเคราะห์พฤติกรรมการใช้งานของผู้ใช้ และเพื่อพัฒนาผลิตภัณฑ์และบริการของเรา\n\nเราให้ความสำคัญกับความเป็นส่วนตัวของผู้ใช้ และจะไม่เปิดเผยข้อมูล IP ของคุณให้กับบุคคลที่สามโดยไม่ได้รับความยินยอมจากคุณ ยกเว้นในกรณีที่กฎหมายกำหนดหรือเพื่อปกป้องสิทธิ์ของเรา\n\nโดยการเข้าถึงหรือใช้งานเว็บไซต์ของเรา คุณยอมรับนโยบายการเก็บข้อมูลนี้ หากคุณไม่เห็นด้วยกับนโยบายดังกล่าว กรุณาหยุดการใช้งานเว็บไซต์ของเรา`;

    // แยกข้อความตามบรรทัด
    const policyLines = policyText.split('\n');
  
    return (
    <div className="flex flex-col px-0 lg:flex-row lg:px-10 items-center justify-center xl:gap-[6rem] h-screen w-screen bg-white lg:bg-background overflow-hidden">
      <div className="w-screen h-screen md:w-[60dvw] md:h-[70dvh] md:border p-5 rounded-md">
      {policyLines.map((line, index) => (
        <p key={index}>{line}</p>
      ))}
        <div>
    <Button>ยอมรับ</Button>

        </div>
    </div>
    </div>
  )
}
